codecuellar/stm32-home-security-system-utn-frt/AFP_5_TDII_2024/AFP_5_TDII_2024/Core/Src/main.c
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.c
  * @brief          : Main program body
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2025 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */
/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "string.h"
#include "API_System.h"
#include "API_Control.h"
#include "API_Display.h"
#include "API_Keypad.h"
#include "API_Alarm.h"
#include "API_PIR.h"
#include "API_Magnetic.h"
#include "API_Log.h"
#include "API_Comm.h"
#include "API_Feedback.h"
#include "API_Debounce.h"
#include "API_Delay.h"
#include "API_GPIO.h"
#include <string.h>
#include <stdlib.h>
#include <stdbool.h>
#include "stm32f4xx_hal_tim.h"
#include "ssd1306.h"
#include "ssd1306_fonts.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */

/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */
// Definiciones
#define INIT_DELAY_MS    500      // 500 ms de parpadeo durante la inicialización
#define ALERT_DELAY_MS   10000    // 10 segundos de retardo antes de activar la alarma
#define PASSWORD         "1234"   // Contraseña predefinida
/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */
// Variables globales
bool systemActive = false; //indica que el sistema esta activo
bool alertTriggered = false; // indica que se a detectado una alerta
bool alarmaActivada = false;
bool sensorsoff= false; // variable que controla la pantalla no muestre alertaas  una vez la alarma se active

uint32_t alertStartTime = 0;
char inputPassword[5] = "";
uint8_t inputIndex = 0;

char tecla;
int intpermit = 3; //intentos permitidos
int intentos = 0; //intentos realizados
int alarmainicio = 0; // variable que controla que solo se inicie el contador una vez y no varias por señales de otros sensores


// variables para el loop de parpadeo del led azul  al encender y apagar
uint8_t continicio = 0;
bool contfin = false;

delay_t delay1;

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/
ADC_HandleTypeDef hadc1;
ETH_TxPacketConfig TxConfig;
ETH_DMADescTypeDef  DMARxDscrTab[ETH_RX_DESC_CNT]; /* Ethernet Rx DMA Descriptors */
ETH_DMADescTypeDef  DMATxDscrTab[ETH_TX_DESC_CNT]; /* Ethernet Tx DMA Descriptors */
ETH_HandleTypeDef heth;
I2C_HandleTypeDef hi2c1;
RTC_HandleTypeDef hrtc;
TIM_HandleTypeDef htim2;
TIM_HandleTypeDef htim3;
TIM_HandleTypeDef htim4;
TIM_HandleTypeDef htim5;
TIM_HandleTypeDef htim9;
TIM_HandleTypeDef htim10;
TIM_HandleTypeDef htim11;


UART_HandleTypeDef huart2;
UART_HandleTypeDef huart3;
PCD_HandleTypeDef hpcd_USB_OTG_FS;

/* USER CODE BEGIN PV */

/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MX_ETH_Init(void);
static void MX_USART3_UART_Init(void);
static void MX_USB_OTG_FS_PCD_Init(void);
static void MX_I2C1_Init(void);
void MX_USART2_UART_Init(void);
static void MX_RTC_Init(void);
static void MX_TIM2_Init(void);
void SistemaOFF(void);

/* USER CODE BEGIN PFP */

/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */

// Prototipos de funciones
void iniciarSistema(void);
void reiniciarSistema(void);
void checkSensors(void);
void activarAlarma(void);
void checkKeypad(void);
void desactivarAlarma(void);
void mostrarAlerta(const char* mensaje);
void bloquearpad(void);
//void Display_ScrollText(const char* text, uint8_t x, uint8_t y, uint16_t delay_ms);


/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  * @retval int
  */
int main(void)
{

  /* USER CODE BEGIN 1 */

  /* USER CODE END 1 */

  /* MCU Configuration--------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();
  MX_I2C1_Init();

  /* USER CODE BEGIN Init */

  // Inicialización de módulos
  initControl();
  Display_Init();
  KeyPad_Init();
  Alarm_Init();
  PIR_Init();
  Magnetic_Init();
  initCommSystem();
  debounceFSM_init();
  delayInit(&delay1, 500);
  /*
  // Mostrar mensaje inicial
  Display_Clear();
  Display_Print("Iniciando sistema...", 0, 0);
  HAL_Delay(5000);
  Display_Clear();*/




  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_ETH_Init();
  MX_USART3_UART_Init();
  MX_USB_OTG_FS_PCD_Init();

  MX_USART2_UART_Init();
  MX_RTC_Init();
  MX_TIM2_Init();
  /* USER CODE BEGIN 2 */

  /* USER CODE END 2 */

  /* Infinite loop */
  /* USER CODE BEGIN WHILE */
  while (1) {
      // Verificar si el sistema está inactivo y se presiona el botón
      if (!systemActive && readButton_GPIO()) {
          iniciarSistema();
          if (systemActive) {
              Display_Clear();
              Display_Print("ESTADO ACTIVO", 0, 0);
              LED_On(LD1); // Encender LED verde
              logEvent("Sistema Activado");
              systemActive = true;
          }
      }

      // Verificar sensores si el sistema está activo
      if (systemActive && !sensorsoff) {
          checkSensors();
      }
  }



  /* USER CODE END 3 */
}

/**
  * @brief System Clock Configuration
  * @retval None
  */

void iniciarSistema(void) {
    alarmainicio = 0;
    intentos = 0;
    Display_Clear();
    Display_Print("Iniciando Sist...", 0, 0);
    feedback_sendAccepted("Iniciando sistema...");
    logEvent("Sistema iniciando");

    int continicio = 0;
    bool contfin = false;
    while (!contfin) {
        if (delayRead(&delay1)) {
            LED_Toggle(LD2); // Toggle LED Azul
            continicio++;

            if (continicio >= 8) { // 4 ON + 4 OFF = 8 cambios
                contfin = true;
                LED_Off(LD2); // Apagar LED Azul
                systemActive = true; // Activar el sistema
                feedback_sendAccepted("ESTADO ACTIVO");
                logEvent("Sistema Activado");
            }
        }
    }
}

void checkSensors(void) {
    static bool PIR_anterior = false;
    static bool magnetico_anterior = false;

    bool PIR = PIR_IsDetected();       // Leer estado del PIR desde driver
    bool magnetico = Magnetic_IsDetected(); // Leer estado del sensor magnético desde driver

    // Detectar flanco ascendente en PIR (cambio de 0 -> 1)
    if (PIR && !PIR_anterior) {
        Display_Clear();
        Display_Print("Alerta por mov", 0, 0);
        feedback_sendRejected("Alerta por mov");
        logEvent("Alerta por movimiento");
        alertStartTime = HAL_GetTick();
        alertTriggered = true;
        alarmainicio++;
    }

    // Detectar flanco ascendente en sensor magnético (cambio de 0 -> 1)
    if (magnetico && !magnetico_anterior) {
        Display_Clear();
        Display_Print("Alerta por apertura", 0, 0);
        feedback_sendRejected("Alerta por apertura");
        logEvent("Alerta por apertura");
        alertStartTime = HAL_GetTick();
        alertTriggered = true;
        alarmainicio++;
    }

    PIR_anterior = PIR;
    magnetico_anterior = magnetico;

    if ((alertTriggered && (HAL_GetTick() - alertStartTime >= ALERT_DELAY_MS)) || intentos >= intpermit) {
        activarAlarma();
        alertTriggered = false;
    }

    if (alertTriggered) {
        checkKeypad();
    }
}



void checkKeypad(void) {
    tecla = key_pad_get_char(100);
    if (tecla != 0) {
    	buzz(); // Feedback audible con función del driver

        if (tecla == '#') { // Tecla # para confirmar
            inputPassword[inputIndex] = '\0';
            if (strcmp(inputPassword, PASSWORD) == 0) {
                desactivarAlarma();
            } else {
                Display_Clear();
                Display_Print("     CODIGO     ", 0, 0);
                Display_Print("   INCORRECTO   ", 0, 10);
                feedback_sendRejected("Clave incorrecta");
                intentos++;
                if (intentos >= intpermit) {
                    Display_Clear();
                    Display_Print("    TECLADO     ", 0, 0);
                    Display_Print("   BLOQUEADO   ", 0, 10);
                    HAL_Delay(3000);
                    alertTriggered = false;
                }
            }
            inputIndex = 0; // Reiniciar índice
        } else if (inputIndex < 4) {
            inputPassword[inputIndex++] = tecla;
            inputPassword[inputIndex] = '\0';
        }
    }
}


void activarAlarma(void) {
    Display_Clear();
    Display_Print("     ALARMA   ", 0, 0);
    Display_Print("    ACTIVADA    ", 0, 10);
    feedback_sendRejected("ALARMA ACTIVADA");
    logEvent("ALARMA ACTIVADA");
    Alarm_On();
    sensorsoff = true; // Desactivar sensores
    alarmaActivada = true;
    while (alertTriggered) {  // 🔹 Mantiene el bucle hasta que se ingrese la clave correcta
        checkKeypad();  // 🔹 Permite ingresar la clave incluso con la alarma encendida
    }
}

void desactivarAlarma(void) {
    Display_Clear();
    Display_Print("     ALARMA     ", 0, 0);
    Display_Print("   DESACTIVADA   ", 0, 10);
    feedback_sendAccepted("ALARMA DESACTIVADA");
    logEvent("ALARMA DESACTIVADA");
    LED_Off(LD3); // Apagar LED rojo
    Alarm_Off(); // Apagar la alarma
    alertTriggered = false;
    inputIndex = 0;
    systemActive = false;
    HAL_Delay(3000);
    SistemaOFF();
}

void mostrarAlerta(const char* mensaje) {
    LED_Off(LD1); // Apagar LED verde
    LED_On(LD3); // Encender LED rojo

    Display_Clear();
    Display_Print((char *)mensaje, 0, 0);  // Mostrar mensaje en el OLED con cast

    alarmainicio++;
    if (alarmainicio == 1) { // Tomar el tiempo solo una vez
        alertStartTime = HAL_GetTick();
        alertTriggered = true;
    }
}
void SistemaOFF(void) {
    LED_Off(LD1);
    LED_Off(LD3);
    Display_Clear();
    Display_Print("Apagando Sist...", 0, 0);

    int continicio = 0;
    bool contfin = false;
    while (!contfin) {
        if (delayRead(&delay1)) {
            LED_Toggle(LD2); // Toggle LED Azul
            continicio++;

            if (continicio >= 8) { // 4 ON + 4 OFF = 8 cambios
                contfin = true;
                LED_Off(LD2); // Apagar LED Azul
            }
        }
    }
    LED_Off(LD2);
    Display_Clear();
}

/*void Display_ScrollText(const char* text, uint8_t x, uint8_t y, uint16_t delay_ms) {
    uint8_t len = strlen(text);
    char buffer[20];  // Tamaño ajustado según tu pantalla

    while (1) {  // Bucle infinito para desplazamiento continuo
        for (int8_t i = sizeof(buffer) - 1; i >= -len; i--) {
            memset(buffer, ' ', sizeof(buffer));  // Llenar el buffer con espacios

            // Copiar el texto al buffer en la posición adecuada
            for (uint8_t j = 0; j < len; j++) {
                if ((i + j) >= 0 && (i + j) < sizeof(buffer)) {
                    buffer[i + j] = text[j];
                }
            }

            Display_Clear();  // Limpiar pantalla en cada ciclo
            Display_Print(buffer, x, y);  // Imprimir buffer desplazado
            HAL_Delay(delay_ms);  // Controlar la velocidad del scroll
        }
    }
}*/



void SystemClock_Config(void)
{
  RCC_OscInitTypeDef RCC_OscInitStruct = {0};
  RCC_ClkInitTypeDef RCC_ClkInitStruct = {0};

  /** Configure the main internal regulator output voltage
  */
  __HAL_RCC_PWR_CLK_ENABLE();
  __HAL_PWR_VOLTAGESCALING_CONFIG(PWR_REGULATOR_VOLTAGE_SCALE1);

  /** Initializes the RCC Oscillators according to the specified parameters
  * in the RCC_OscInitTypeDef structure.
  */
  RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_LSI|RCC_OSCILLATORTYPE_HSE;
  RCC_OscInitStruct.HSEState = RCC_HSE_BYPASS;
  RCC_OscInitStruct.LSIState = RCC_LSI_ON;
  RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
  RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSE;
  RCC_OscInitStruct.PLL.PLLM = 4;
  RCC_OscInitStruct.PLL.PLLN = 168;
  RCC_OscInitStruct.PLL.PLLP = RCC_PLLP_DIV2;
  RCC_OscInitStruct.PLL.PLLQ = 7;
  if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
  {
    Error_Handler();
  }

  /** Initializes the CPU, AHB and APB buses clocks
  */
  RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK|RCC_CLOCKTYPE_SYSCLK
                              |RCC_CLOCKTYPE_PCLK1|RCC_CLOCKTYPE_PCLK2;
  RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
  RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
  RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV4;
  RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV2;

  if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_5) != HAL_OK)
  {
    Error_Handler();
  }
}

/**
  * @brief ETH Initialization Function
  * @param None
  * @retval None
  */
static void MX_ETH_Init(void)
{

  /* USER CODE BEGIN ETH_Init 0 */

  /* USER CODE END ETH_Init 0 */

   static uint8_t MACAddr[6];

  /* USER CODE BEGIN ETH_Init 1 */

  /* USER CODE END ETH_Init 1 */
  heth.Instance = ETH;
  MACAddr[0] = 0x00;
  MACAddr[1] = 0x80;
  MACAddr[2] = 0xE1;
  MACAddr[3] = 0x00;
  MACAddr[4] = 0x00;
  MACAddr[5] = 0x00;
  heth.Init.MACAddr = &MACAddr[0];
  heth.Init.MediaInterface = HAL_ETH_RMII_MODE;
  heth.Init.TxDesc = DMATxDscrTab;
  heth.Init.RxDesc = DMARxDscrTab;
  heth.Init.RxBuffLen = 1524;

  /* USER CODE BEGIN MACADDRESS */

  /* USER CODE END MACADDRESS */

  if (HAL_ETH_Init(&heth) != HAL_OK)
  {
    Error_Handler();
  }

  memset(&TxConfig, 0 , sizeof(ETH_TxPacketConfig));
  TxConfig.Attributes = ETH_TX_PACKETS_FEATURES_CSUM | ETH_TX_PACKETS_FEATURES_CRCPAD;
  TxConfig.ChecksumCtrl = ETH_CHECKSUM_IPHDR_PAYLOAD_INSERT_PHDR_CALC;
  TxConfig.CRCPadCtrl = ETH_CRC_PAD_INSERT;
  /* USER CODE BEGIN ETH_Init 2 */

  /* USER CODE END ETH_Init 2 */

}

/**
  * @brief I2C1 Initialization Function
  * @param None
  * @retval None
  */
static void MX_I2C1_Init(void)
{

  /* USER CODE BEGIN I2C1_Init 0 */

  /* USER CODE END I2C1_Init 0 */

  /* USER CODE BEGIN I2C1_Init 1 */

  /* USER CODE END I2C1_Init 1 */
  hi2c1.Instance = I2C1;
  hi2c1.Init.ClockSpeed = 100000;
  hi2c1.Init.DutyCycle = I2C_DUTYCYCLE_2;
  hi2c1.Init.OwnAddress1 = 0;
  hi2c1.Init.AddressingMode = I2C_ADDRESSINGMODE_7BIT;
  hi2c1.Init.DualAddressMode = I2C_DUALADDRESS_DISABLE;
  hi2c1.Init.OwnAddress2 = 0;
  hi2c1.Init.GeneralCallMode = I2C_GENERALCALL_DISABLE;
  hi2c1.Init.NoStretchMode = I2C_NOSTRETCH_DISABLE;
  if (HAL_I2C_Init(&hi2c1) != HAL_OK)
  {
    Error_Handler();
  }

  /** Configure Analogue filter
  */
  if (HAL_I2CEx_ConfigAnalogFilter(&hi2c1, I2C_ANALOGFILTER_ENABLE) != HAL_OK)
  {
    Error_Handler();
  }

  /** Configure Digital filter
  */
  if (HAL_I2CEx_ConfigDigitalFilter(&hi2c1, 0) != HAL_OK)
  {
    Error_Handler();
  }
  /* USER CODE BEGIN I2C1_Init 2 */

  /* USER CODE END I2C1_Init 2 */

}

/**
  * @brief RTC Initialization Function
  * @param None
  * @retval None
  */
static void MX_RTC_Init(void)
{

  /* USER CODE BEGIN RTC_Init 0 */

  /* USER CODE END RTC_Init 0 */

  RTC_TimeTypeDef sTime = {0};
  RTC_DateTypeDef sDate = {0};

  /* USER CODE BEGIN RTC_Init 1 */

  /* USER CODE END RTC_Init 1 */

  /** Initialize RTC Only
  */
  hrtc.Instance = RTC;
  hrtc.Init.HourFormat = RTC_HOURFORMAT_24;
  hrtc.Init.AsynchPrediv = 127;
  hrtc.Init.SynchPrediv = 255;
  hrtc.Init.OutPut = RTC_OUTPUT_DISABLE;
  hrtc.Init.OutPutPolarity = RTC_OUTPUT_POLARITY_HIGH;
  hrtc.Init.OutPutType = RTC_OUTPUT_TYPE_OPENDRAIN;
  if (HAL_RTC_Init(&hrtc) != HAL_OK)
  {
    Error_Handler();
  }

  /* USER CODE BEGIN Check_RTC_BKUP */

  /* USER CODE END Check_RTC_BKUP */

  /** Initialize RTC and set the Time and Date
  */
  sTime.Hours = 0x0;
  sTime.Minutes = 0x0;
  sTime.Seconds = 0x0;
  sTime.DayLightSaving = RTC_DAYLIGHTSAVING_NONE;
  sTime.StoreOperation = RTC_STOREOPERATION_RESET;
  if (HAL_RTC_SetTime(&hrtc, &sTime, RTC_FORMAT_BCD) != HAL_OK)
  {
    Error_Handler();
  }
  sDate.WeekDay = RTC_WEEKDAY_MONDAY;
  sDate.Month = RTC_MONTH_JANUARY;
  sDate.Date = 0x1;
  sDate.Year = 0x0;

  if (HAL_RTC_SetDate(&hrtc, &sDate, RTC_FORMAT_BCD) != HAL_OK)
  {
    Error_Handler();
  }
  /* USER CODE BEGIN RTC_Init 2 */

  /* USER CODE END RTC_Init 2 */

}

/**
  * @brief TIM2 Initialization Function
  * @param None
  * @retval None
  */
static void MX_TIM2_Init(void)
{

  /* USER CODE BEGIN TIM2_Init 0 */

  /* USER CODE END TIM2_Init 0 */

  TIM_ClockConfigTypeDef sClockSourceConfig = {0};
  TIM_MasterConfigTypeDef sMasterConfig = {0};

  /* USER CODE BEGIN TIM2_Init 1 */

  /* USER CODE END TIM2_Init 1 */
  htim2.Instance = TIM2;
  htim2.Init.Prescaler = 1599;
  htim2.Init.CounterMode = TIM_COUNTERMODE_UP;
  htim2.Init.Period = 999;
  htim2.Init.ClockDivision = TIM_CLOCKDIVISION_DIV1;
  htim2.Init.AutoReloadPreload = TIM_AUTORELOAD_PRELOAD_DISABLE;
  if (HAL_TIM_Base_Init(&htim2) != HAL_OK)
  {
    Error_Handler();
  }
  sClockSourceConfig.ClockSource = TIM_CLOCKSOURCE_INTERNAL;
  if (HAL_TIM_ConfigClockSource(&htim2, &sClockSourceConfig) != HAL_OK)
  {
    Error_Handler();
  }
  sMasterConfig.MasterOutputTrigger = TIM_TRGO_RESET;
  sMasterConfig.MasterSlaveMode = TIM_MASTERSLAVEMODE_DISABLE;
  if (HAL_TIMEx_MasterConfigSynchronization(&htim2, &sMasterConfig) != HAL_OK)
  {
    Error_Handler();
  }
  /* USER CODE BEGIN TIM2_Init 2 */

  /* USER CODE END TIM2_Init 2 */

}

/**
  * @brief USART2 Initialization Function
  * @param None
  * @retval None
  */
void MX_USART2_UART_Init(void)
{

  /* USER CODE BEGIN USART2_Init 0 */

  /* USER CODE END USART2_Init 0 */

  /* USER CODE BEGIN USART2_Init 1 */

  /* USER CODE END USART2_Init 1 */
  huart2.Instance = USART2;
  huart2.Init.BaudRate = 9600;
  huart2.Init.WordLength = UART_WORDLENGTH_8B;
  huart2.Init.StopBits = UART_STOPBITS_1;
  huart2.Init.Parity = UART_PARITY_NONE;
  huart2.Init.Mode = UART_MODE_TX_RX;
  huart2.Init.HwFlowCtl = UART_HWCONTROL_NONE;
  huart2.Init.OverSampling = UART_OVERSAMPLING_16;
  if (HAL_UART_Init(&huart2) != HAL_OK)
  {
    Error_Handler();
  }
  /* USER CODE BEGIN USART2_Init 2 */

  /* USER CODE END USART2_Init 2 */

}



/**
  * @brief USART3 Initialization Function
  * @param None
  * @retval None
  */
static void MX_USART3_UART_Init(void)
{

  /* USER CODE BEGIN USART3_Init 0 */

  /* USER CODE END USART3_Init 0 */

  /* USER CODE BEGIN USART3_Init 1 */

  /* USER CODE END USART3_Init 1 */
  huart3.Instance = USART3;
  huart3.Init.BaudRate = 115200;
  huart3.Init.WordLength = UART_WORDLENGTH_8B;
  huart3.Init.StopBits = UART_STOPBITS_1;
  huart3.Init.Parity = UART_PARITY_NONE;
  huart3.Init.Mode = UART_MODE_TX_RX;
  huart3.Init.HwFlowCtl = UART_HWCONTROL_NONE;
  huart3.Init.OverSampling = UART_OVERSAMPLING_16;
  if (HAL_UART_Init(&huart3) != HAL_OK)
  {
    Error_Handler();
  }
  /* USER CODE BEGIN USART3_Init 2 */

  /* USER CODE END USART3_Init 2 */

}

/**
  * @brief USB_OTG_FS Initialization Function
  * @param None
  * @retval None
  */
static void MX_USB_OTG_FS_PCD_Init(void)
{

  /* USER CODE BEGIN USB_OTG_FS_Init 0 */

  /* USER CODE END USB_OTG_FS_Init 0 */

  /* USER CODE BEGIN USB_OTG_FS_Init 1 */

  /* USER CODE END USB_OTG_FS_Init 1 */
  hpcd_USB_OTG_FS.Instance = USB_OTG_FS;
  hpcd_USB_OTG_FS.Init.dev_endpoints = 4;
  hpcd_USB_OTG_FS.Init.speed = PCD_SPEED_FULL;
  hpcd_USB_OTG_FS.Init.dma_enable = DISABLE;
  hpcd_USB_OTG_FS.Init.phy_itface = PCD_PHY_EMBEDDED;
  hpcd_USB_OTG_FS.Init.Sof_enable = ENABLE;
  hpcd_USB_OTG_FS.Init.low_power_enable = DISABLE;
  hpcd_USB_OTG_FS.Init.lpm_enable = DISABLE;
  hpcd_USB_OTG_FS.Init.vbus_sensing_enable = ENABLE;
  hpcd_USB_OTG_FS.Init.use_dedicated_ep1 = DISABLE;
  if (HAL_PCD_Init(&hpcd_USB_OTG_FS) != HAL_OK)
  {
    Error_Handler();
  }
  /* USER CODE BEGIN USB_OTG_FS_Init 2 */

  /* USER CODE END USB_OTG_FS_Init 2 */

}

/**
  * @brief GPIO Initialization Function
  * @param None
  * @retval None
  */


/* USER CODE BEGIN 4 */

/* USER CODE END 4 */

/**
  * @brief  This function is executed in case of error occurrence.
  * @retval None
  */
void Error_Handler(void)
{
  /* USER CODE BEGIN Error_Handler_Debug */
  /* User can add his own implementation to report the HAL error return state */
  __disable_irq();
  while (1)
  {
  }
  /* USER CODE END Error_Handler_Debug */
}

#ifdef  USE_FULL_ASSERT
/**
  * @brief  Reports the name of the source file and the source line number
  *         where the assert_param error has occurred.
  * @param  file: pointer to the source file name
  * @param  line: assert_param error line source number
  * @retval None
  */
void assert_failed(uint8_t *file, uint32_t line)
{
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line number,
     ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */
}

void MX_ADC1_Init(void) {
    hadc1.Instance = ADC1;
    hadc1.Init.ClockPrescaler = ADC_CLOCK_SYNC_PCLK_DIV4;
    hadc1.Init.Resolution = ADC_RESOLUTION_12B;
    hadc1.Init.ScanConvMode = DISABLE;
    hadc1.Init.ContinuousConvMode = DISABLE;
    hadc1.Init.DiscontinuousConvMode = DISABLE;
    hadc1.Init.ExternalTrigConv = ADC_SOFTWARE_START;
    hadc1.Init.DataAlign = ADC_DATAALIGN_RIGHT;
    hadc1.Init.NbrOfConversion = 1;
    HAL_ADC_Init(&hadc1);
}


#endif /* USE_FULL_ASSERT */
